using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Ques : MonoBehaviour
{
    // 出題順
    public static int[] Order = {
        0, 1, 2, 3, 4, 5, 6, 7, 8, 9,
        10, 11, 12, 13, 14, 15, 16, 17, 18, 19,
        20, 21, 22, 23, 24, 25, 26, 27, 28, 29,
        30, 31, 32, 33, 34, 35, 36, 37, 38, 39,
        40, 41, 42, 43, 44, 45, 46, 47, 48, 49,
        50, 51, 52, 53, 54, 55, 56, 57, 58, 59,
        60, 61, 62, 63, 64, 65, 66, 67, 68, 69,
        70, 71, 72, 73, 74, 75, 76, 77, 78, 79,
        80, 81, 82, 83, 84, 85, 86, 87, 88, 89,
        90, 91, 92, 93, 94, 95, 96, 97, 98, 99
    };

    // 選択肢（mod6した値が正解）
    public static readonly int[,] Choices = {
        {0,1,2,3}, {1,0,2,3}, {1,2,0,3}, {1,2,3,0}, 
        {0,1,3,2}, {1,0,3,2}, {2,1,0,3}, {1,3,2,0}, 
        {0,2,1,3}, {2,0,1,3}, {1,3,0,2}, {2,1,3,0}, 
        {0,2,3,1}, {2,0,3,1}, {3,1,0,2}, {2,3,1,0},
        {0,3,1,2}, {3,0,1,2}, {2,3,0,1}, {3,1,2,0}, 
        {0,3,2,1}, {3,0,2,1}, {3,2,0,1}, {3,2,1,0}
    };

    // 問題の待ち時間棒の時間当たり増分
    public static readonly float[] Inc = {
        0.0f,   // ０番目はダミー
        0.05f, 0.10f, 0.15f, 0.20f, 0.25f, 0.30f, 0.35f, 0.40f, 0.45f, 0.50f, 
        0.55f, 0.60f, 0.65f, 0.70f, 0.75f, 0.80f, 0.85f, 0.90f, 0.95f, 1.00f, 
    };

    // 問題
    public static readonly string[] Q = {
        "問題 1", // 問題 1
        "問題 2", // 問題 2
        "問題 3", // 問題 3
        "問題 4", // 問題 4
        "問題 5", // 問題 5
        "問題 6", // 問題 6
        "問題 7", // 問題 7
        "問題 8", // 問題 8
        "問題 9", // 問題 9
        "問題10", // 問題10
        "問題11", // 問題11
        "問題12", // 問題12
        "問題13", // 問題13
        "問題14", // 問題14
        "問題15", // 問題15
        "問題16", // 問題16
        "問題17", // 問題17
        "問題18", // 問題18
        "問題19", // 問題19
        "問題20", // 問題20
        "問題21", // 問題21
        "問題22", // 問題22
        "問題23", // 問題23
        "問題24", // 問題24
        "問題25", // 問題25
        "問題26", // 問題26
        "問題27", // 問題27
        "問題28", // 問題28
        "問題29", // 問題29
        "問題30", // 問題30
        "問題31", // 問題31
        "問題32", // 問題32
        "問題33", // 問題33
        "問題34", // 問題34
        "問題35", // 問題35
        "問題36", // 問題36
        "問題37", // 問題37
        "問題38", // 問題38
        "問題39", // 問題39
        "問題40", // 問題40
        "問題41", // 問題41
        "問題42", // 問題42
        "問題43", // 問題43
        "問題44", // 問題44
        "問題45", // 問題45
        "問題46", // 問題46
        "問題47", // 問題47
        "問題48", // 問題48
        "問題49", // 問題49
        "問題50", // 問題50
        "問題51", // 問題51
        "問題52", // 問題52
        "問題53", // 問題53
        "問題54", // 問題54
        "問題55", // 問題55
        "問題56", // 問題56
        "問題57", // 問題57
        "問題58", // 問題58
        "問題59", // 問題59
        "問題60", // 問題60
        "問題61", // 問題61
        "問題62", // 問題62
        "問題63", // 問題63
        "問題64", // 問題64
        "問題65", // 問題65
        "問題66", // 問題66
        "問題67", // 問題67
        "問題68", // 問題68
        "問題69", // 問題69
        "問題70", // 問題70
        "問題71", // 問題71
        "問題72", // 問題72
        "問題73", // 問題73
        "問題74", // 問題74
        "問題75", // 問題75
        "問題76", // 問題76
        "問題77", // 問題77
        "問題78", // 問題78
        "問題79", // 問題79
        "問題80", // 問題80
        "問題81", // 問題81
        "問題82", // 問題82
        "問題83", // 問題83
        "問題84", // 問題84
        "問題85", // 問題85
        "問題86", // 問題86
        "問題87", // 問題87
        "問題88", // 問題88
        "問題89", // 問題89
        "問題90", // 問題90
        "問題91", // 問題91
        "問題92", // 問題92
        "問題93", // 問題93
        "問題94", // 問題94
        "問題95", // 問題95
        "問題96", // 問題96
        "問題97", // 問題97
        "問題98", // 問題98
        "問題99", // 問題99
        "題100" // 問題100
    };

    // 選択肢（０番目が正解）
    public static readonly string[,] A = {
        {"正解","268.9k㎡","274.9k㎡","285.9k㎡"}, // 問題 1
        {"正解","あじさい","パンジー","つつじ"}, // 問題 2
        {"正解","イチョウ","ヤマザクラ","くすのき"}, // 問題 3
        {"正解","5万人","9万人","11万人"}, // 問題 4
        {"正解","恵庭岩","恵庭神社","恵庭山"}, // 問題 5
        {"正解","昭和42年11月1日","昭和44年11月1日","昭和48年11月1日"}, // 問題 6
        {"正解","さくら踊り","阿波踊り","えにわ踊り"}, // 問題 7
        {"正解","島松神社例大祭","柏木神社例大祭","恵庭神社例大祭"}, // 問題 8
        {"正解","岳","山","緑"}, // 問題 9
        {"正解","恵み野中央公園","ルルマップ自然公園","桜町多目的広場"}, // 問題10
        {"正解","ぼっちゃんかぼちゃ","かなみんかぼちゃ","ロロンかぼちゃ"}, // 問題11
        {"正解","島松駅","恵庭駅","恵み野駅"}, // 問題12
        {"正解","原田 裕氏","黒氏 博実氏","中島 興世氏"}, // 問題13
        {"正解","4月20日","8月7日","10月25日"}, // 問題14
        {"正解","山口県玖珂郡和木町","ドイツ ケルン市","南極大陸"}, // 問題15
        {"正解","スパル座","恵庭館","東宝シネマ8"}, // 問題16
        {"正解","アローラロコン","ピカチュウ","イーブィ"}, // 問題17
        {"正解","インクラの滝","七ツ滝","龍王の滝"}, // 問題18
        {"正解","はるか","ゆきね","わかば"}, // 問題19
        {"正解","2人","4人","48人"}, // 問題20
        {"正解","プール","スキー場","ゴルフ場"}, // 問題21
        {"正解","千歳市民スキー場","スポーツセンター","ゴルフ場"}, // 問題22
        {"正解","えにあす","らじあす","えにらじ"}, // 問題23
        {"正解","77.6MHz","100MHz","77.4hPa"}, // 問題24
        {"正解","石炭","コーヒー","チョコレート"}, // 問題25
        {"正解","ダム","湖","スケート場"}, // 問題26
        {"正解","子どもひろば","図書室","カフェ"}, // 問題27
        {"正解","ラルマナイ","ルルマップ","イチイ"}, // 問題28
        {"正解","1","20","126"}, // 問題29
        {"正解","千歳","小樽","北広島"}, // 問題30
        {"正解","札幌市","北広島市","千歳市"}, // 問題31
        {"正解","えにわんバス","ゆうゆうバス","わくわくバス"}, // 問題32
        {"正解","えにわ丸","めぐみの助","あいちゃん"}, // 問題33
        {"正解","宇宙","星屑","流星"}, // 問題34
        {"正解","りんご","薔薇","みかん"}, // 問題35
        {"正解","樹木","とうきび","鳩"}, // 問題36
        {"正解","えこりん村","はなふる","花ロード"}, // 問題37
        {"正解","アサヒビール","キリンビール","サントリー"}, // 問題38
        {"正解","えにわ湖","はなふる","市民スキー場"}, // 問題39
        {"正解","陶芸","習字","盆踊り"}, // 問題40
        {"正解","つつじ","すずらん","さくら"}, // 問題41
        {"正解","漁川","茂漁川","ルルマップ川"}, // 問題42
        {"正解","楽しい場所","美しい水面","幸福な予感"}, // 問題43
        {"正解","豊かな水源","尖ってる山","面白い場所"}, // 問題44
        {"正解","1トン","7500kg","0kg"}, // 問題45
        {"正解","ロード","スノー","キャンドル"}, // 問題46
        {"正解","鹿鳴館","遊就館","島松館"}, // 問題47
        {"正解","花のまち","ガーデンシティ","えにわの花"}, // 問題48
        {"正解","めぐみの市","屋台市","グルメ市"}, // 問題49
        {"正解","14校","11校","6校"}, // 問題50
        {"正解","12つ","9つ","4つ"}, // 問題51
        {"正解","ヒヨドリ","ハクセキレイ","シマエナガ"}, // 問題52
        {"正解","すずらん","バラ","紅葉"}, // 問題53
        {"正解","グラタン","ラーメン","チャーハン"}, // 問題54
        {"正解","アイスソード","ゆうきのあかし","優しい気持ち"}, // 問題55
        {"正解","中恵庭","恵み野","本庁"}, // 問題56
        {"正解","1980","1999","2003"}, // 問題57
        {"正解","恵村と入庭村","恵野村と豊栄村","安達と島村"}, // 問題58
        {"正解","漁神社","島松神社","すずらん神社"}, // 問題59
        {"正解","こうのとり文庫","あおぞら絵本","ファミリアブック"}, // 問題60
        {"正解","漁鉄道","すずらん鉄道","ルルマップ鉄道"}, // 問題61
        {"正解","馬車","そり","人力"}, // 問題62
        {"正解","市場","デパート","遊園地"}, // 問題63
        {"正解","新千歳空港","北海道文教大学","恵庭第一病院"}, // 問題64
        {"正解","馬ぞり","乗馬","餌やり体験"}, // 問題65
        {"正解","野球場","日本庭園","冒険広場"}, // 問題66
        {"正解","ﾌｫﾚｽﾄｱﾄﾞﾍﾞﾝﾁｬｰ","市民農園","パークゴルフ場"}, // 問題67
        {"正解","柏木地区キャンプ場","ほのキャンプ","ﾙﾙﾏｯﾌﾟキャンプ場"}, // 問題68
        {"正解","銀の匙","うしおととら","銀魂"}, // 問題69
        {"正解","ガーデニングｺﾝｸｰﾙ","わくわくｺﾝｸｰﾙ","漫画ｺﾝｸｰﾙ"}, // 問題70
        {"正解","鮭","すずらん","かなみん"}, // 問題71
        {"正解","花","本","恵庭岳"}, // 問題72
        {"正解","市役所","漁川","恵庭駅"}, // 問題73
        {"正解","鮭がいっぱい","湿った沼","すずらんの群生地"}, // 問題74
        {"正解","チップ","鯱","ブラックバス"}, // 問題75
        {"正解","漆製品","サメの歯","琥珀"}, // 問題76
        {"正解","すずらんの群生地","川の近く","素敵な場所"}, // 問題77
        {"正解","辰砂","鉛丹","紅花色素"}, // 問題78
        {"正解","お届け窓口","深夜の窓口","みんなの窓口"}, // 問題79
        {"正解","すずらん","ふれらんど","えにわん"}, // 問題80
        {"正解","古本持ち寄り大会","自作本の寄付受付","本のお焚き上げ"}, // 問題81
        {"正解","本の販売","本の漫画化","本の映画化"}, // 問題82
        {"正解","サバゲー開催","お見合い","仮装お茶会"}, // 問題83
        {"正解","1位","2位","3位"}, // 問題84
        {"正解","まちなかライブラリ","ブックライフ","私の図書館"}, // 問題85
        {"正解","約100冊","約2千冊","約1億冊"}, // 問題86
        {"正解","1975年","2013年","2020年"}, // 問題87
        {"正解","ブルーベリー","マルベリー","クランベリー"}, // 問題88
        {"正解","ローズコンフィ","ローズシロップ","薔薇と蜂蜜のコンフィ"}, // 問題89
        {"正解","かなみん握手券","えこりん村の年パス","一日市長権"}, // 問題90
        {"正解","江別市","北広島市","千歳市"}, // 問題91
        {"正解","オナガアゲハ","オオルリオサムシ","カバイロシジミ"}, // 問題92
        {"正解","真夏","漁川","鈴蘭"}, // 問題93
        {"正解","火の輪くぐり","空中ブランコ","猛獣ショー"}, // 問題94
        {"正解","100個","500個","1000個"}, // 問題95
        {"正解","図書カード","小為替","切手"}, // 問題96
        {"正解","文教物語","恵庭ストーリー","ルルマップ白書"}, // 問題97
        {"正解","恵庭ドーム","すずらんホール","漁川体育館"}, // 問題98
        {"正解","ルルマップらんど","すずらん教室","のびのびコーナー"}, // 問題99
        {"正解","かるみん","えにみん","にこみん"} // 問題100
    };

    // 付加情報（あるものにだけある）
    public static readonly string[] I = {
        "", // 問題 1
        "", // 問題 2
        "", // 問題 3
        "", // 問題 4
        "恵庭岳の大きく尖った部分をアイヌ語で表現したものなんだって！", // 問題 5
        "", // 問題 6
        "", // 問題 7
        "", // 問題 8
        "", // 問題 9
        "", // 問題10
        "", // 問題11
        "", // 問題12
        "", // 問題13
        "", // 問題14
        "", // 問題15
        "", // 問題16
        "", // 問題17
        "", // 問題18
        "", // 問題19
        "えにわっ娘.のラジオ番組もぐらじ！もよろしくね", // 問題20
        "", // 問題21
        "", // 問題22
        "", // 問題23
        "", // 問題24
        "", // 問題25
        "", // 問題26
        "", // 問題27
        "", // 問題28
        "", // 問題29
        "", // 問題30
        "", // 問題31
        "", // 問題32
        "", // 問題33
        "", // 問題34
        "", // 問題35
        "", // 問題36
        "", // 問題37
        "", // 問題38
        "", // 問題39
        "", // 問題40
        "", // 問題41
        "", // 問題42
        "", // 問題43
        "", // 問題44
        "", // 問題45
        "", // 問題46
        "", // 問題47
        "", // 問題48
        "", // 問題49
        "", // 問題50
        "2022年には全国規模で開催されるガーデンフェスタ北海道2022が恵庭で開催されたんだよ！", // 問題51
        "", // 問題52
        "", // 問題53
        "", // 問題54
        "", // 問題55
        "正しくは島松！", // 問題56
        "", // 問題57
        "漁村は山口県からの入植者がたくさんいたんだって！", // 問題58
        "", // 問題59
        "恵庭は、読書のまちともよばれてるんだ", // 問題60
        "恵庭駅までの29.7キロを繋いでいたよ！", // 問題61
        "郷土資料館にモデルが置いてあるよ！", // 問題62
        "鉄道が出来るまでは恵庭の入り口だったんだね", // 問題63
        "", // 問題64
        "昭和30年頃まで開催してたんだっよ!", // 問題65
        "プールはないけど浅瀬の川があるよ！", // 問題66
        "", // 問題67
        "", // 問題68
        "", // 問題69
        "", // 問題70
        "高度複合機能都市のPRをしていたよ", // 問題71
        "", // 問題72
        "", // 問題73
        "", // 問題74
        "元気に帰ってくるのを楽しみに待ってるね", // 問題75
        "アフリカの民族楽器、カリンバと同じ名前♪", // 問題76
        "", // 問題77
        "", // 問題78
        "一部の記入作業が軽減されるみたい！", // 問題79
        "", // 問題80
        "１年間雑誌寄付するとカバーと書架に広告を載せてもらえるよ♪", // 問題81
        "片道300円で自宅までお届け！（2024年現在）", // 問題82
        "", // 問題83
        "恵庭市はみんなの憧れなんだね♪", // 問題84
        "", // 問題85
        "", // 問題86
        "", // 問題87
        "", // 問題88
        "", // 問題89
        "車中泊用の家具で、テーブルやベッドになるんだよ！", // 問題90
        "近隣の都市の水源を担っているよ♪", // 問題91
        "", // 問題92
        "", // 問題93
        "", // 問題94
        "", // 問題95
        "", // 問題96
        "", // 問題97
        "大学が使用しない日は地元への開放も視野に入れてるんだって♪", // 問題98
        "", // 問題99
        "" // 問題100
    };
}
