using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Ques : MonoBehaviour
{
    public static readonly string[] Q = {
        "恵庭市の面積は何平方キロメートル？", // 問題 1
        "恵庭市のシンボルの花は何？", // 問題 2
        "恵庭市のシンボルの木は何？", // 問題 3
        "恵庭市の人口はおおよそ何人？", // 問題 4
        "恵庭市の由来となった「エエンイワ」とはどういう意味？", // 問題 5
        "恵庭市が市制施行年されたのはいつ？", // 問題 6
        "昭和48年8月に恵庭市の郷土芸能として制定された踊りは次のうちどれ？", // 問題 7
        "毎年10月中旬に行われる恵庭市で開催されるお祭りは？", // 問題 8
        "恵庭市の市章に描かれた組み合わされた輪郭の線は何を表している？", // 問題 9
        "恵庭市で1番大きな公園は次のうちどこ？", // 問題10
        "恵庭市の特産品『えびすかぼちゃ』はどれ？", // 問題11
        "恵庭市に属するJRの駅は…", // 問題12
        "恵庭市の歴代市長の中で最も任期が長い市長は誰でしょう？", // 問題13
        "恵庭市の観光施設「はなふる」がオープンした日はいつ？", // 問題14
        "平成28年3月26日締結された恵庭市の友好都市は次のうちどこ？", // 問題15
        "恵庭市で3番目に開館された映画館の名前はどれ？", // 問題16
        "「道と川の駅花ロードえにわ」にあるポケふたには何のポケモンが描かれているでしょう？", // 問題17
        "市内の観光スポットの一つである恵庭渓谷には三つの滝が見られる。ラルマナイの滝・白扇の滝とあと一つはどれ？", // 問題18
        "道と川の駅花ロードえにわの隣にある新鮮な野菜などが買えるお店の名前は？", // 問題19
        "北海道文教大学に食育の大切さを広めるため、アイドルグループ「えにわっ娘.」が誕生。初期メンバーは何人？", // 問題20
        "恵庭市にないものはどれ？", // 問題21
        "恵庭市民も千歳市民と同額になる優待といえば…", // 問題22
        "恵庭のコミュニティラジオといえば？", // 問題23
        "恵庭のコミュニティラジオの周波数は？", // 問題24
        "1998年まで恵庭で営業していた温泉は、その湯色からなんと呼ばれていた？", // 問題25
        "恵庭市にないものはどれ？", // 問題26
        "生涯学習施設かしわのもりにないものはどれ？", // 問題27
        "恵庭にある遺跡の名前は？", // 問題28
        "恵庭市の所有する重要文化財は何点？", // 問題29
        "スイーツで有名なICHIEのお店、恵庭市ともう1店舗はどこ？", // 問題30
        "次のうち、恵庭市に隣接してないのはどれ？", // 問題31
        "えにわコミュニティバスの愛称は？", // 問題32
        "えにわコミュニティバスのマスコットキャラクターは？", // 問題33
        "えこりん村にある、庭園の名称は？", // 問題34
        "えこりん村にある、巨大な木はなに？", // 問題35
        "札幌の大通公園にあるもののうち、大半が恵庭産のものはどれ？", // 問題36
        "大人気番組タカトシ牧場のロケで有名なのは？", // 問題37
        "恵庭市に工場があるのは？", // 問題38
        "例年、えにわ犬ぞり大会が開催されていたのはどこ？", // 問題39
        "IZARI villageで出来ることは何？", // 問題40
        "えこりん村で６～７月に開催されるのは何のお祭り？", // 問題41
        "次のうち、恵庭市内に属さないのは？", // 問題42
        "ルルマップ川の名前はアイヌ語でなんという意味？", // 問題43
        "漁川の名前はアイヌ語でなんという意味？", // 問題44
        "恵庭鉱山で採掘された金の累計採掘量は？", // 問題45
        "毎年2月に市内で開催される氷や水でできたスノーランタンが見られるイベントはえにわ何ナイト？", // 問題46
        "昔は醤油や酒などの商品保管庫として島松に建造され、現在はイベントホールや喫茶店になっている建物の名前は？", // 問題47
        "半崎美子さんが歌う、ガーデンフェスタ北海道2022のテーマソングのタイトルは？", // 問題48
        "恵み野商店会で開催される屋台やフリマなどが開催されるイベントの名前は？", // 問題49
        "恵庭に小学校はいくつある？", // 問題50
        "花の拠点はなふるのガーデンはテーマごとに分かれているその数は？", // 問題51
        "茂漁川のキャラクター【モイちゃん】はどんな鳥をモチーフにしている？", // 問題52
        "えにわ湖にあるのは、何公園？", // 問題53
        "串カツ屋まるご商店さんが開発した、漁川ダムにちなんだメニューは？(現在販売終了)", // 問題54
        "漁川ダムでもらえるものは？", // 問題55
        "恵庭4地区ではないものはどれ？", // 問題56
        "恵庭市の人口増が初めてストップしたのはいつ？", // 問題57
        "明治39年に誕生した恵庭村は、どことどこが合併したもの？", // 問題58
        "毎年例大祭が盛り上がる豊栄神社の前身は？", // 問題59
        "全国に先駆け、絵本などを子育て世帯にプレゼントして親子で楽しむ事を推奨するプロジェクトは？", // 問題60
        "", // 問題61
        "", // 問題62
        "", // 問題63
        "", // 問題64
        "", // 問題65
        "", // 問題66
        "", // 問題67
        "", // 問題68
        "", // 問題69
        "", // 問題70
        "", // 問題71
        "", // 問題72
        "", // 問題73
        "", // 問題74
        "", // 問題75
        "", // 問題76
        "", // 問題77
        "", // 問題78
        "", // 問題79
        "", // 問題80
        "", // 問題81
        "", // 問題82
        "", // 問題83
        "", // 問題84
        "", // 問題85
        "", // 問題86
        "", // 問題87
        "", // 問題88
        "", // 問題89
        "", // 問題90
        "", // 問題91
        "", // 問題92
        "", // 問題93
        "", // 問題94
        "", // 問題95
        "", // 問題96
        "", // 問題97
        "", // 問題98
        "", // 問題99
        "" // 問題100
    };

    public static readonly string[,] A = {
        {"294.9k㎡","268.9k㎡","274.9k㎡","285.9k㎡"}, // 問題 1
        {"すずらん","あじさい","パンジー","つつじ"}, // 問題 2
        {"イチイの木","イチョウ","ヤマザクラ","くすのき"}, // 問題 3
        {"7万人","5万人","9万人","11万人"}, // 問題 4
        {"","","",""}, // 問題 5
        {"","","",""}, // 問題 6
        {"","","",""}, // 問題 7
        {"","","",""}, // 問題 8
        {"","","",""}, // 問題 9
        {"","","",""}, // 問題10
        {"","","",""}, // 問題11
        {"","","",""}, // 問題12
        {"","","",""}, // 問題13
        {"","","",""}, // 問題14
        {"","","",""}, // 問題15
        {"","","",""}, // 問題16
        {"","","",""}, // 問題17
        {"","","",""}, // 問題18
        {"","","",""}, // 問題19
        {"","","",""}, // 問題20
        {"","","",""}, // 問題21
        {"","","",""}, // 問題22
        {"","","",""}, // 問題23
        {"","","",""}, // 問題24
        {"","","",""}, // 問題25
        {"","","",""}, // 問題26
        {"","","",""}, // 問題27
        {"","","",""}, // 問題28
        {"","","",""}, // 問題29
        {"","","",""}, // 問題30
        {"","","",""}, // 問題31
        {"","","",""}, // 問題32
        {"","","",""}, // 問題33
        {"","","",""}, // 問題34
        {"","","",""}, // 問題35
        {"","","",""}, // 問題36
        {"","","",""}, // 問題37
        {"","","",""}, // 問題38
        {"","","",""}, // 問題39
        {"","","",""}, // 問題40
        {"","","",""}, // 問題41
        {"","","",""}, // 問題42
        {"","","",""}, // 問題43
        {"","","",""}, // 問題44
        {"","","",""}, // 問題45
        {"","","",""}, // 問題46
        {"","","",""}, // 問題47
        {"","","",""}, // 問題48
        {"","","",""}, // 問題49
        {"","","",""}, // 問題50
        {"","","",""}, // 問題51
        {"","","",""}, // 問題52
        {"","","",""}, // 問題53
        {"","","",""}, // 問題54
        {"","","",""}, // 問題55
        {"","","",""}, // 問題56
        {"","","",""}, // 問題57
        {"","","",""}, // 問題58
        {"","","",""}, // 問題59
        {"","","",""}, // 問題60
        {"","","",""}, // 問題61
        {"","","",""}, // 問題62
        {"","","",""}, // 問題63
        {"","","",""}, // 問題64
        {"","","",""}, // 問題65
        {"","","",""}, // 問題66
        {"","","",""}, // 問題67
        {"","","",""}, // 問題68
        {"","","",""}, // 問題69
        {"","","",""}, // 問題70
        {"","","",""}, // 問題71
        {"","","",""}, // 問題72
        {"","","",""}, // 問題73
        {"","","",""}, // 問題74
        {"","","",""}, // 問題75
        {"","","",""}, // 問題76
        {"","","",""}, // 問題77
        {"","","",""}, // 問題78
        {"","","",""}, // 問題79
        {"","","",""}, // 問題80
        {"","","",""}, // 問題81
        {"","","",""}, // 問題82
        {"","","",""}, // 問題83
        {"","","",""}, // 問題84
        {"","","",""}, // 問題85
        {"","","",""}, // 問題86
        {"","","",""}, // 問題87
        {"","","",""}, // 問題88
        {"","","",""}, // 問題89
        {"","","",""}, // 問題90
        {"","","",""}, // 問題91
        {"","","",""}, // 問題92
        {"","","",""}, // 問題93
        {"","","",""}, // 問題94
        {"","","",""}, // 問題95
        {"","","",""}, // 問題96
        {"","","",""}, // 問題97
        {"","","",""}, // 問題98
        {"","","",""}, // 問題99
        {"","","",""} // 問題100
    };

}
